In [1]:
import pandas as pd

In [2]:
dict1 = pd.DataFrame({"Name" : ["ram","suresh","ramesh"],
         "age":[23,26,25]})

In [3]:
dict1

     Name  age
0     ram   23
1  suresh   26
2  ramesh   25

In [4]:
series_1 = pd.Series([23,556,321,22])

In [5]:
series_1

0     23
1    556
2    321
3     22
dtype: int64

In [6]:
dict1.head(1)

  Name  age
0  ram   23

In [7]:
dict1.tail(1)

     Name  age
2  ramesh   25

In [8]:
dict1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [9]:
dict1.describe()

             age
count   3.000000
mean   24.666667
std     1.527525
min    23.000000
25%    24.000000
50%    25.000000
75%    25.500000
max    26.000000

In [10]:
dict1.age

0    23
1    26
2    25
Name: age, dtype: int64

In [11]:
dict1.Name

0       ram
1    suresh
2    ramesh
Name: Name, dtype: object

In [12]:
dict1[['age','Name']]

   age    Name
0   23     ram
1   26  suresh
2   25  ramesh

In [13]:
dict1.iloc[:, 0:1]

     Name
0     ram
1  suresh
2  ramesh

In [14]:
import pandas as pd

data = {
    'name': ['Ram', 'Syam', 'Akhil', 'Naveen'],
    'age': [20, 22, 25, 24],
    'salary': [30000, 35000, 40000, 37000]
}

df = pd.DataFrame(data)

In [15]:
df.age

0    20
1    22
2    25
3    24
Name: age, dtype: int64

In [16]:
df[['age','salary']]

   age  salary
0   20   30000
1   22   35000
2   25   40000
3   24   37000

In [17]:
df.iloc[0:,0:2]

     name  age
0     Ram   20
1    Syam   22
2   Akhil   25
3  Naveen   24

In [18]:
df.loc[df.age > 20,['age','salary']]

   age  salary
1   22   35000
2   25   40000
3   24   37000

In [19]:
data_emp    = {'name':['suresh','ramesh','alice','bob','mahesh','virat','sachin','gill','shubham','sonam','jagu','ishan','kisan','harry','sundhar','dulqar salman'],
               'age': [21,23,23,24,26,32,23,45,32,29,34,34,41,42,23,34],
               'salary':[10000,30000,32000,20000,29000,45000,34000,10000,21000,10020,38000,23000,23900,21000,45000,30000]}
df = pd.DataFrame(data_emp)

In [20]:
df

             name  age  salary
0          suresh   21   10000
1          ramesh   23   30000
2           alice   23   32000
3             bob   24   20000
4          mahesh   26   29000
5           virat   32   45000
6          sachin   23   34000
7            gill   45   10000
8         shubham   32   21000
9           sonam   29   10020
10           jagu   34   38000
11          ishan   34   23000
12          kisan   41   23900
13          harry   42   21000
14        sundhar   23   45000
15  dulqar salman   34   30000

In [21]:
df.head(10)

      name  age  salary
0   suresh   21   10000
1   ramesh   23   30000
2    alice   23   32000
3      bob   24   20000
4   mahesh   26   29000
5    virat   32   45000
6   sachin   23   34000
7     gill   45   10000
8  shubham   32   21000
9    sonam   29   10020

In [22]:
df.iloc[5:15]

       name  age  salary
5     virat   32   45000
6    sachin   23   34000
7      gill   45   10000
8   shubham   32   21000
9     sonam   29   10020
10     jagu   34   38000
11    ishan   34   23000
12    kisan   41   23900
13    harry   42   21000
14  sundhar   23   45000

In [23]:
df.loc[df.age>30,['age']]

    age
5    32
7    45
8    32
10   34
11   34
12   41
13   42
15   34

In [24]:
df.info(data_emp)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    16 non-null     object
 1   age     16 non-null     int64
 2   salary  16 non-null     int64
dtypes: int64(2), object(1)
memory usage: 516.0+ bytes

In [25]:
df.shape

(16, 3)

In [26]:
df.salary

0     10000
1     30000
2     32000
3     20000
4     29000
5     45000
6     34000
7     10000
8     21000
9     10020
10    38000
11    23000
12    23900
13    21000
14    45000
15    30000
Name: salary, dtype: int64

In [27]:
df['bonus'] = df['salary'] * 0.10

In [28]:
df

             name  age  salary   bonus
0          suresh   21   10000  1000.0
1          ramesh   23   30000  3000.0
2           alice   23   32000  3200.0
3             bob   24   20000  2000.0
4          mahesh   26   29000  2900.0
5           virat   32   45000  4500.0
6          sachin   23   34000  3400.0
7            gill   45   10000  1000.0
8         shubham   32   21000  2100.0
9           sonam   29   10020  1002.0
10           jagu   34   38000  3800.0
11          ishan   34   23000  2300.0
12          kisan   41   23900  2390.0
13          harry   42   21000  2100.0
14        sundhar   23   45000  4500.0
15  dulqar salman   34   30000  3000.0

In [29]:
df.loc[df.salary > 30000]

       name  age  salary   bonus
2     alice   23   32000  3200.0
5     virat   32   45000  4500.0
6    sachin   23   34000  3400.0
10     jagu   34   38000  3800.0
14  sundhar   23   45000  4500.0

In [31]:
df.loc[(df.salary > 25000) & (df.age>25)]

             name  age  salary   bonus
4          mahesh   26   29000  2900.0
5           virat   32   45000  4500.0
10           jagu   34   38000  3800.0
15  dulqar salman   34   30000  3000.0

In [32]:
df.loc[df.name == 'sachin']

     name  age  salary   bonus
6  sachin   23   34000  3400.0

In [33]:
df.sort_values('salary')

             name  age  salary   bonus
0          suresh   21   10000  1000.0
7            gill   45   10000  1000.0
9           sonam   29   10020  1002.0
3             bob   24   20000  2000.0
8         shubham   32   21000  2100.0
13          harry   42   21000  2100.0
11          ishan   34   23000  2300.0
12          kisan   41   23900  2390.0
4          mahesh   26   29000  2900.0
15  dulqar salman   34   30000  3000.0
1          ramesh   23   30000  3000.0
2           alice   23   32000  3200.0
6          sachin   23   34000  3400.0
10           jagu   34   38000  3800.0
5           virat   32   45000  4500.0
14        sundhar   23   45000  4500.0

In [34]:
df.sort_values('salary',ascending = False)

             name  age  salary   bonus
5           virat   32   45000  4500.0
14        sundhar   23   45000  4500.0
10           jagu   34   38000  3800.0
6          sachin   23   34000  3400.0
2           alice   23   32000  3200.0
15  dulqar salman   34   30000  3000.0
1          ramesh   23   30000  3000.0
4          mahesh   26   29000  2900.0
12          kisan   41   23900  2390.0
11          ishan   34   23000  2300.0
13          harry   42   21000  2100.0
8         shubham   32   21000  2100.0
3             bob   24   20000  2000.0
9           sonam   29   10020  1002.0
7            gill   45   10000  1000.0
0          suresh   21   10000  1000.0

In [35]:
df.sort_values(['salary','age'],ascending = [True,False])

             name  age  salary   bonus
7            gill   45   10000  1000.0
0          suresh   21   10000  1000.0
9           sonam   29   10020  1002.0
3             bob   24   20000  2000.0
13          harry   42   21000  2100.0
8         shubham   32   21000  2100.0
11          ishan   34   23000  2300.0
12          kisan   41   23900  2390.0
4          mahesh   26   29000  2900.0
15  dulqar salman   34   30000  3000.0
1          ramesh   23   30000  3000.0
2           alice   23   32000  3200.0
6          sachin   23   34000  3400.0
10           jagu   34   38000  3800.0
5           virat   32   45000  4500.0
14        sundhar   23   45000  4500.0

In [42]:
df.groupby('salary')['age'].min()

salary
10000    21
10020    29
20000    24
21000    32
23000    34
23900    41
29000    26
30000    23
32000    23
34000    23
38000    34
45000    23
Name: age, dtype: int64

In [43]:
df['department'] = [
    'HR','Finance','IT','IT','Sales','HR','IT','Finance',
    'Sales','HR','Finance','IT','HR','Sales','IT','Finance'
]

In [44]:
df

             name  age  salary   bonus department
0          suresh   21   10000  1000.0         HR
1          ramesh   23   30000  3000.0    Finance
2           alice   23   32000  3200.0         IT
3             bob   24   20000  2000.0         IT
4          mahesh   26   29000  2900.0      Sales
5           virat   32   45000  4500.0         HR
6          sachin   23   34000  3400.0         IT
7            gill   45   10000  1000.0    Finance
8         shubham   32   21000  2100.0      Sales
9           sonam   29   10020  1002.0         HR
10           jagu   34   38000  3800.0    Finance
11          ishan   34   23000  2300.0         IT
12          kisan   41   23900  2390.0         HR
13          harry   42   21000  2100.0      Sales
14        sundhar   23   45000  4500.0         IT
15  dulqar salman   34   30000  3000.0    Finance

In [47]:
df.loc[df['department'] == 'HR','salary'] += 50000

In [48]:
df

             name  age  salary   bonus department
0          suresh   21   60000  1000.0         HR
1          ramesh   23   30000  3000.0    Finance
2           alice   23   32000  3200.0         IT
3             bob   24   20000  2000.0         IT
4          mahesh   26   29000  2900.0      Sales
5           virat   32   95000  4500.0         HR
6          sachin   23   34000  3400.0         IT
7            gill   45   10000  1000.0    Finance
8         shubham   32   21000  2100.0      Sales
9           sonam   29   60020  1002.0         HR
10           jagu   34   38000  3800.0    Finance
11          ishan   34   23000  2300.0         IT
12          kisan   41   73900  2390.0         HR
13          harry   42   21000  2100.0      Sales
14        sundhar   23   45000  4500.0         IT
15  dulqar salman   34   30000  3000.0    Finance

In [49]:
df.loc[df['department'] == 'IT','salary'] += 15000

In [50]:
df

             name  age  salary   bonus department
0          suresh   21   60000  1000.0         HR
1          ramesh   23   30000  3000.0    Finance
2           alice   23   47000  3200.0         IT
3             bob   24   35000  2000.0         IT
4          mahesh   26   29000  2900.0      Sales
5           virat   32   95000  4500.0         HR
6          sachin   23   49000  3400.0         IT
7            gill   45   10000  1000.0    Finance
8         shubham   32   21000  2100.0      Sales
9           sonam   29   60020  1002.0         HR
10           jagu   34   38000  3800.0    Finance
11          ishan   34   38000  2300.0         IT
12          kisan   41   73900  2390.0         HR
13          harry   42   21000  2100.0      Sales
14        sundhar   23   60000  4500.0         IT
15  dulqar salman   34   30000  3000.0    Finance